# Data engineering syntax assessment (14 pts total)

## Question 1 (8 points)

A U.S graduate school has students from Asia, Europe, and America. The students' continents of origin and colleges are stored in a data frame STUDENTS. You can assume that there may be duplicate records, as shown below:<br> <br>
| name   | continent |  college  |<br>
|--------|-----------|-------------|<br>
|  Andy  | America   |  Lib Arts   |<br>
|  Jose  | Europe    |  Business   |<br>
|  Dieu  | Asia      | Engineering |<br>
|  Chloe | America   | Engineering |<br>
|  Jose  | Europe    |  Business   |<br><br>
Please write R or Pandas code to create a new data frame COUNTS that counts the number of unique student records corresponding to each continent, college pair. Lay out the data in a 3x3 grid with colleges sorted reverse alphabetically on the vertical axis. The horizontal axis does not need to be sorted. Null values should be zero-filled. For the sample input, the desired output would be:<br><br>
|  continent  | America | Asia | Europe |<br>
|   college   |---------|------|--------|<br>
|  Lib Arts   |    1    |  0   |   0    |<br>
| Engineering |    1    |  1   |   0    |<br>
|  Business   |    0    |  0   |   1    |<br>

In [1]:
## sample test STUDENTS data frame
import pandas as pd
df_students = pd.DataFrame({
    'name':['Andy','Jose' ,'Dieu' ,'Chloe' ,'Jose'],
    'continent':['America', 'Europe', 'Asia' ,'America' ,'Europe'],
    'college':['Lib Arts' ,'Business', 'Engineering', 'Engineering' ,'Business']
})

df_students

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

#### A) Write R or Pandas code to de-dup STUDENTS (1pt):

In [2]:
## Drop duplicates inplace
df_students.drop_duplicates(inplace = True)
df_students

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

#### B) Create a data frame COUNTS storing the count of students for each continent, college pair (2pts):

In [3]:
df_counts = df_students.groupby(by = ['continent','college']).count().reset_index(drop=False).rename(columns = {'name':'counts'})
df_counts

  continent      college  counts
0   America  Engineering       1
1   America     Lib Arts       1
2      Asia  Engineering       1
3    Europe     Business       1

#### C) Pivot COUNTS so that continent values become column names (2pts):

In [4]:
df_counts = df_counts.pivot(index = 'college', columns = 'continent',values = 'counts')
df_counts

continent    America  Asia  Europe
college
Business         NaN   NaN     1.0
Engineering      1.0   1.0     NaN
Lib Arts         1.0   NaN     NaN

#### D) If applicable, remove any unnecessary index levels created in part C (1pts):

In [5]:
# df_pivot_counts.rename_axis(index=None, columns=None, inplace = True)
# df_pivot_counts

# Not Applicable

#### E) Zero-fill missing values in COUNTS (1pt):

In [6]:
df_counts.fillna(0, inplace=True)
df_counts

continent    America  Asia  Europe
college
Business         0.0   0.0     1.0
Engineering      1.0   1.0     0.0
Lib Arts         1.0   0.0     0.0

#### F) Sort COUNTS reverse alphabetically by college name (1pt):

In [7]:
df_counts.sort_index(ascending = False, inplace=True)
df_counts

continent    America  Asia  Europe
college
Lib Arts         1.0   0.0     0.0
Engineering      1.0   1.0     0.0
Business         0.0   0.0     1.0

## Question 2 (6 points)

#### A)	Select the answer to complete the assigned task (2pts)
![alt text](Picture1.png)

Of the months April, May, and June, calculate how many had eggs>100

A) (df.loc[[‘apr’, ‘may’, ‘jun’],][‘eggs’] > 100).sum() <br>
B) (df[[‘apr’, ‘may’, ‘jun’],][‘eggs’] > 100).sum() <br>
C) (df[[‘apr’,’may’,’jun’]][‘eggs’] > 100).sum() <br>
D) (df[(‘apr’, ‘may’, ‘jun’),][‘eggs’] > 100).count() <br>


#### Option A is correct:
- Using loc, we can access a group of rows and columns by labels

In [8]:
# Sample data frame
df = pd.DataFrame({
    'eggs':[47,110,221,77,132,205],
    'salt':[12.0,50.0,89.0,87.0,0.0,60.0],
    'spam' :[17,31,72,20,52,55]
}, index = ['jan','feb','mar','apr','may','jun'])

# Option A is correct:
# using loc, we can access a group of rows and columns by labels
print("Of the months April, May, and June, calculate how many had eggs>100:",
      (df.loc[['apr', 'may', 'jun'],]['eggs'] > 100).sum())

Of the months April, May, and June, calculate how many had eggs>100: 2

#### B)	Complete the script to produce the output shown (2pts) 
<u>Output</u> <br>
datetime.date(2018, 1, 1)<br>

<u>Script</u> <br>
import datetime <br>
datetime.datetime._______(‘01012018’, “%d%m%Y”)________ <br>

A) strptime, .date() <br>
B) strptime, .as.date() <br>
C) to_date, [Nothing] <br>
D) to_datetime, [Nothing] <br>

#### option A is correct
- strptime() method creates a datetime object from a give string
- date() converts datetime object to date object

In [9]:
# option A is correct
# strptime() method creates a datetime object from a give string
# date() converts datetime object to date object
import datetime
datetime.datetime.strptime('01012018', "%d%m%Y").date()

datetime.date(2018, 1, 1)

#### C) Select the correct script to accomplish the task (2pts)

Following is a summary of the iris dataset: <br>

![alt text](Picture2.png)
 
How would you create a new object with: <br>
-	only the “setosa” species <br>
-	Petal.Width greater than 2 <br>
-	Sorted by Sepal.Length in descending order <br>

A)	iris[(iris[‘Species’] == ‘setosa’) && (iris[‘Petal.Width’] > 2)].sort_values(‘Sepal.Length’, ascending = False)  <br>
B)	iris.loc[(iris[‘Species’] == ‘setosa’) & (iris[‘Petal.Width’] > 2)].sort_values(‘Sepal.Length’, ascending = False) <br> 
C)	iris.loc[(iris[‘Species’] == ‘setosa’) & (iris[‘Petal.Width’] > 2)].sort_values(‘Sepal.Length’, desc)  <br>
D)	iris[(iris[‘Species’] == ‘setosa’) & (iris[‘Petal.Width’] > 2)].sort_descending(‘Sepal.Length’)  <br>

#### Option B is correct and has the correct syntax